<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dsekt-infra","backend":"e6b753866570ff1817aececbbee962f11263697d935152568bcdd88c689084ba","plan_job_ref":"Job Create OpenTofu plan #43 at https://github.com/datasektionen/infra/actions/runs/11355343711","plan_out_hash":"588632a8018812781436f07f8508600238d9a5e3bcf503c39249c487d03a7c22","plan_hash":"b09673e25332d558dfb90ce495585743f6693a84d90ef1b4842ac4ba41c97eef","plan_text_format":"diff","version":"1.44.0"} -->
OpenTofu plan for __dsekt-infra__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # github_actions_secret.nomad_token_pls will be created
+   resource "github_actions_secret" "nomad_token_pls" {
+       created_at      = (known after apply)
+       id              = (known after apply)
+       plaintext_value = (sensitive value)
+       repository      = "pls"
+       secret_name     = "NOMAD_TOKEN"
+       updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create OpenTofu plan #43](https://github.com/datasektionen/infra/actions/runs/11355343711)